Revit 2024 API
NumberingSchema.AppendSequence Method
 Appends all elements of one numbering sequence to the end of another sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void AppendSequence(
	string fromPartition,
	string toPartition
)
Visual Basic
Public Sub AppendSequence ( _
	fromPartition As String, _
	toPartition As String _
)
Visual C++
public:
void AppendSequence(
	String^ fromPartition,
	String^ toPartition
)
Parameters
fromPartition
Type: System.String
 Name of the partition that determines which numbering sequence to append. The sequence must exist already, otherwise an exception will be thrown.
toPartition
Type: System.String
 Name of a partition into which the source sequence is going to be appended. The sequence must exist already, otherwise an exception will be thrown.
Remarks
All numbers assigned to elements in the target sequence remain the same, but numbers in the source sequence (the one getting appended) will change. Elements that match elements in the target sequence will get the same numbers assigned. Remaining elements will get consecutive numbers in the creation order of the elements starting with the next highest number available in the target sequence.
This operation modifies the Partition parameter of all elements in the sequence that is getting appended. Therefore, all its elements must be accessible for editing, otherwise this operation will fail.
Elements can be appended only to a sequence that already exists. In order to reassign elements of one sequence to a partition that does not exist yet, use either the MoveSequence or MergeSequences methods.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The sequence fromPartition does not exist in the schema. -or- The sequence toPartition does not exist in the schema. -or- Given partition names fromPartition and toPartition must be different.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Either the schema or its document cannot be modified at present. -or- Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM parameter assigned. It may be an indication that the element is not free to be edited at present.
See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace